<?php
function teacher_aboutInfo()
{
    $string = "
    
    <p style='color:black;'> 
    طلابي الأعزاء كل عام وأنتم بخير .... 
    التطبيق محاولة جادة ومتخصصة لتفعيل النظام الجديد بكل تفاصيله بمعنى أنك ستتدرب في كل حصة على الامتحانات والأسئلة وطرق الحل الصحيحة والتي تحقق لك التفوق بإذن الله في النظام التعليمي الجديد .
    التطبيق ليس بنكا لتخزين الأسئلة والتدريبات ، ولكنه موقع تعليمي متكامل ( سنتر الكتروني ) يحقق كل أهداف العملية التعليمية وعلى رأسها التعود على أسئلة الامتحانات بأشكالها المختلفة ، والمتابعة الجادة مني شخصيا ومن فريق العمل بشكل عام لكل إجاباتكم وحلولكم في جميع التقويمات 
    والهدف الأكبر للتطبيق أنه يجعلك على تواصل معي ومع فريق العمل على مدار 24 ساعة من خلال الأسئلة والاستفسارات المختلفة .
    سيكون بمقدورك أيضا من خلال التطبيق أن تقيم نفسك وتعرف مستواك الحقيقي من خلال الواجبات والاختبارات الجزئية والاختبارات العامة .
    طبعا سيكون الهاتف المحمول ( الموبايل ) والتاب الوسيلة التي نستخدمها في الاختبار الاسبوعي الذي سيكون في بداية كل حصة أو في المنزل في الموعد المحدد لكل الطلاب في نفس الوقت .
    تستطيع أيضا عرض أي مشكلة خاصة بعدم قدرتك على التحصيل والفهم لأي نوع من أنواع المسائل وسوف أقوم شخصيا بمتابعة هذه الحالات ووضعها على الطريق الصحيح .
    أيضا يحقق التطبيق التواصل الفعال بين ولي الأمر وبيننا لتحقيق الصالح العام للطالب في المقام الأول . من خلال متابعة درجات الطالب ومتابعة الحضور والغياب . 
    كما نقوم أيضا بعمل خطط لرفع مستوى الضعاف من خلال واجبات خاصة وتدريبات متميزة لتحسين المستوى .
    مع ملاحظة أن غياب ثلاث حصص يعرضك لغلق التطبيق والحرمان من خدماته بشكل كامل .
    على كل حال ... أهلا بكم  في هذا الملتقى التعليمي المتميز  لنتعاون جميعا من خلال منظومة إلكترونية متخصصة للوصول إلى أعلى الدرجات في مادة التاريخ مع العالمي حسام هارون.
    </p>
    
    ";

    return json_encode(['status' => "success", "data" => $string, "error" => ""]);
}
function teacher_confirm_signup()
{
    return "false";
}